export interface ISkills {
	name: string;
	level: number;
}

export const codingSkillsData: ISkills[] = [
	{
		name: "HTML",
		level: 80,
	},
	{
		name: "CSS / SCSS",
		level: 80,
	},
	{
		name: "JavaScript",
		level: 70,
	},
	{
		name: "TypeScript",
		level: 60,
	},
	{
		name: "ReactJS",
		level: 70,
	},
	{
		name: "NextJS",
		level: 60,
	},
	{
		name: "Tailwind CSS",
		level: 60,
	},
];

export const profSkillsData: ISkills[] = [
	{
		name: "Figma",
		level: 50,
	},
	{
		name: "Web Design",
		level: 40,
	},
	{
		name: "Git / GitHub",
		level: 50,
	},
	{
		name: "Photoshop",
		level: 40,
	},
	{
		name: "Affinity Photo / Designer",
		level: 40,
	},
	{
		name: "NodeJS",
		level: 50,
	},
	{
		name: "Webpack",
		level: 60,
	},
];

export const aboutMeData: string[] = [
	"Окончил Самарский государственный архитектурно-строительный университет, получил квалификацию инженера по специальности «Промышленное и гражданское строительство».",

	"Долгое время я работал по своей специальности, участвуя в строительстве крупных нефтегазовых объектов и их инфраструктуры. В ходе этой работы я приобрел полезные навыки, такие как ответственность, соблюдение сроков, коммуникабельность  и умение работать в команде в рамках нескольких подразделений. Также я научился быстро обрабатывать большой объем информации и работать с технической и юридической документацией. Последнее место моей работы – должность начальника отдела подготовки производства.",

	"Моё знакомство с программированием началось ещё в университете как хобби. Я изучал языки C и C++ и мне очень нравилось то, как быстро можно получить результат и насколько много вариантов решения одной задачи. Кроме того, я всегда чувствовал, что есть куда расти.",
	"Позже я заинтересовался веб-разработкой и изучил такие языки, как JavaScript, HTML и CSS. Это стало для меня возможностью превратить моё хобби в профессию. Я выбрал этот путь и с тех пор активно развиваюсь в этой области.",
	"Свободное время уделяю спорту, саморазвитию и фотографии.",
];
