export interface ISkills {
	name: string;
	level: number;
}

export const codingSkillsData: ISkills[] = [
	{
		name: "HTML",
		level: 80,
	},
	{
		name: "CSS / SCSS",
		level: 80,
	},
	{
		name: "JavaScript",
		level: 70,
	},
	{
		name: "TypeScript",
		level: 60,
	},
	{
		name: "ReactJS",
		level: 70,
	},
	{
		name: "NextJS",
		level: 60,
	},
	{
		name: "Tailwind CSS",
		level: 60,
	},
];

export const profSkillsData: ISkills[] = [
	{
		name: "Figma",
		level: 50,
	},
	{
		name: "Web Design",
		level: 40,
	},
	{
		name: "Git / GitHub",
		level: 50,
	},
	{
		name: "Photoshop",
		level: 40,
	},
	{
		name: "Affinity Photo / Designer",
		level: 40,
	},
	{
		name: "NodeJS",
		level: 50,
	},
	{
		name: "Webpack",
		level: 60,
	},
];

export const aboutMeData: string[] = [
	"Практический опыт в разработке: 1 год.",
	"Окончил Самарский государственный архитектурно-строительный Университет. Квалификация: инженер по специальности Промышленное и Гражданское строительство.",
	"Долгое время работал по полученной специальности. Участвовал в строительстве крупных нефтегазовых объектов и их инфраструктуре. Благодаря чему получил огромный опыт работы в команде и опыт управления командой. Последнее место работы - начальник отдела подготовки производства.",
	"Моё знакомство с программированием началось ещё в университете с языка C / C++. Программирование привлекает меня скоростью получения результата, огромным набором вариантов выполнения одной и той же задачи, а также тем, что всегда есть куда развиваться. Немного позже я заинтересовался web-разработкой. Изучил такие языки, как JavaScript, HTML и CSS. Web-разработка стала моим хобби.",
	"С течением времени интерес к программированию только нарастал. Я принял решение превратить своё хобби в свою профессию.",
	"Свободное время уделяю спорту, саморазвитию и фотографиям.",
	"Готов использовать свои знания и навыки для достижения целей вашей компании.",
];
