export interface ISkills {
	name: string;
	level: number;
}

export const codingSkillsData: ISkills[] = [
	{ name: "HTML", level: 80 },
	{ name: "CSS / SCSS", level: 80 },
	{ name: "JavaScript", level: 75 },
	{ name: "TypeScript", level: 60 },
	{ name: "ReactJS", level: 70 },
	{ name: "NextJS", level: 60 },
	{ name: "Tailwind CSS", level: 60 },
];

export const profSkillsData: ISkills[] = [
	{ name: "Figma", level: 50 },
	{ name: "Web Design", level: 40 },
	{ name: "Git / GitHub", level: 50 },
	{ name: "Photoshop", level: 40 },
	{ name: "Redux Toolkit", level: 50 },
	{ name: "NodeJS", level: 50 },
	{ name: "Webpack", level: 50 },
];

export const aboutMeData: string[] = [
	"Мой практический опыт в разработке составляет более двух лет, а также я обладаю более чем 10-летним многогранным опытом в различных сферах деятельности.",
	"Окончил Самарский государственный архитектурно-строительный университет, получил квалификацию инженера по специальности «Промышленное и гражданское строительство».",

	"В течение длительного периода я работал в строительстве крупных нефтегазовых объектов и их инфраструктуры, где я развил не только ключевые навыки ответственности, умения работать в команде и эффективно управлять проектами, но и способность быстро обрабатывать информацию и работать с технической и юридической документацией. На последнем месте работы я занимал должность начальника отдела подготовки производства.",

	"Моё стартовое знакомство с программированием началось в университете как часть увлечения. Изучение языков программирования C и C++ позволило мне оценить быстроту получения результатов и гибкость вариантов решения задач. Со временем мое увлечение перешло в сферу веб-разработки, где я освоил JavaScript, HTML и CSS, превращая свое хобби в профессию. С тех пор я старательно развиваюсь в этой области, стремясь достичь новых высот.",

	"В свободное время я придерживаюсь активного образа жизни, уделяя внимание спорту, саморазвитию и фотографии.",
];
